---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAnalyticalPropertyData
source: html/1b6aa6c7-35a8-46cf-8e05-efa5665f8f5d.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAnalyticalPropertyData Method

Gets the electrical analytical node property data, Nothing nullptr a null reference ( Nothing in Visual Basic) if not available.

## Syntax (C#)
```csharp
public AnalyticalDistributionNodePropertyData GetAnalyticalPropertyData()
```

## Returns
The electrical analytical node property data.

## Remarks
These types have special data:
 Bus TransferSwitch EquipmentLoad